# IExtElemChangeBeamSection Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExtElemChangeBeamSection Methods
IExtElemChangeBeamSection Interface See Also
---
The IExtElemChangeBeamSection type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ChangeSection | The method that will be called when user wants to change beam section |

# See Also
IExtElemChangeBeamSection Interface
Autodesk.Revit.DB.Structure Namespace